lsh1315/UDINGO_STM32/UDINGO/Core/Src/main.c
  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, Command, SDRAM_TIMEOUT);

  /* Step 4 : Configure a Auto-Refresh command */
  Command->CommandMode = FMC_SDRAM_CMD_AUTOREFRESH_MODE;
  Command->CommandTarget = FMC_SDRAM_CMD_TARGET_BANK2;
  Command->AutoRefreshNumber = 8;
  Command->ModeRegisterDefinition = 0;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, Command, SDRAM_TIMEOUT);

  /* Step 5: Program the external memory mode register */
  tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1          |
                     SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL   |
                     SDRAM_MODEREG_CAS_LATENCY_2           |
                     SDRAM_MODEREG_OPERATING_MODE_STANDARD |
                     SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;

  Command->CommandMode = FMC_SDRAM_CMD_LOAD_MODE;
  Command->CommandTarget = FMC_SDRAM_CMD_TARGET_BANK2;
  Command->AutoRefreshNumber = 1;
  Command->ModeRegisterDefinition = tmpmrd;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, Command, SDRAM_TIMEOUT);

  /* Step 6: Set the refresh rate counter */
  /* Set the device refresh rate */
  HAL_SDRAM_ProgramRefreshRate(hsdram, REFRESH_COUNT); 

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartUWB */
/**
* @brief Function implementing the UWB thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartUWB */
void StartUWB(void *argument)
{
  /* USER CODE BEGIN StartUWB */
  /* Infinite loop */
  for(;;)
  {
    // 세마포어 신호가 올 때까지 무한정 기다립니다. (이때 태스크는 휴면 상태)
    if (xSemaphoreTake(uart4RxSemaphore, portMAX_DELAY) == pdTRUE)
    {
        // 이 아래 코드는 오직 UART 인터럽트가 신호를 줬을 때만 실행됩니다.
        if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n-------- UWB ---------\r\n", 28, 100) != HAL_OK){
            Error_Handler();
        }

        // 현재 위치 계산, 업데이트
        // update_current_position(position);

        // update_current_position(position) 내부 로직(+ 로그 출력)
        uint8_t original_position[2];
        int dist[4] = {0,};

        // dwm1000 거리 수신 및 나머지 로직 실행
        receive_dwm1000_distances(dist);

        sprintf(str, "%d mm | %d mm | %d mm | %d mm\r\n", dist[0],dist[1],dist[2],dist[3]);
        HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

        trilaterate(dist, original_position);
        sprintf(str, "Position(cm) : (%d, %d) ", original_position[0], original_position[1]);
        HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

        correction(original_position, position);
        sprintf(str, "---> (%d, %d)\r\n", position[0],position[1]);
        HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
    }
    // xSemaphoreTake가 대기 역할을 하므로 osDelay()는 필요 없습니다.
  }
  /* USER CODE END StartUWB */
}

/* USER CODE BEGIN Header_StartPathPlanning */
/**
* @brief Function implementing the PathPlanning thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartPathPlanning */
void StartPathPlanning(void *argument)
{
  /* USER CODE BEGIN StartPathPlanning */
  /* Infinite loop */
  for(;;)
  {
    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n---- PathPlanning ----\r\n", 28, 100) != HAL_OK){
      Error_Handler();
    }
    // 5-2. 최적의 주차 공간 탐색 및 경로 계획
    // find_preferred_parking: 사용자 선호도에 따라 최적의 빈 주차 공간(goal)을 탐색
    // astar: 현재 위치(position)에서 목적지(goal)까지의 최적 경로(path)를 A* 알고리즘으로 계산
    // 경로의 길이를 반환하며, goal과 path는 전역변수에 저장됨
    find_preferred_parking(user_preference, map_matrix, map_rows, map_cols, goal);
    path_length = astar(position, goal, map_matrix, map_rows, map_cols, path);
    // ★ TouchGFX Model로 추천 좌표 전달
    gui_update_recommended_parking((int)goal[0], (int)goal[1]); // 수정된 코드
    gui_update_path_points((uint8_t*)path, path_length);
    osDelay(1000);
  }
  /* USER CODE END StartPathPlanning */
}

/* USER CODE BEGIN Header_StartPrintDebug */
/**
* @brief Function implementing the PrintDebug thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartPrintDebug */
void StartPrintDebug(void *argument)
{
  /* USER CODE BEGIN StartPrintDebug */
  /* Infinite loop */
  for(;;)
  {
    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n-------- Print Debug --------\r\n", 35, 100) != HAL_OK){
      Error_Handler();
    }

    // 5-3. 결과 출력 (향후 GUI로 대체될 부분)

    // 위치 출력
    sprintf(str, "position: (%d, %d)\r\n", position[0], position[1]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    // 목적지 출력
    sprintf(str, "goal: (%d, %d)\r\n", goal[0], goal[1]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    // 경로 출력
    sprintf(str, "path:\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    for(int i = 0; i < path_length; i++) {
      sprintf(str, "(%d, %d) -> ", path[i][0], path[i][1]);
      HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
    }

    sprintf(str, "end!\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    osDelay(3000);
  }
  /* USER CODE END StartPrintDebug */
}

/* USER CODE BEGIN Header_StartServer */
/**
* @brief Function implementing the Server thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartServer */
void StartServer(void *argument)
{
  /* USER CODE BEGIN StartServer */
  /* Infinite loop */
  for(;;)
  {
    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n---- Server begin ----\r\n", 26, 100) != HAL_OK){
      Error_Handler();
    }
    // 점유정보 받아오기
    update_parking_occupancy(map_matrix);

    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n----- Server end -----\r\n", 26, 100) != HAL_OK){
      Error_Handler();
    }
    osDelay(3000);
  }
  /* USER CODE END StartServer */
}

